# InsulationType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationType Class
Members See Also
---
Represents electrical insulation type definition information.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InsulationType : ElementType
```

Visual Basic
---
```text
Public Class InsulationType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class InsulationType : public ElementType
```

# Remarks
Insulation type is defined based on corresponding wire material type and temperature rating type.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Electrical..::..InsulationType
# See Also
InsulationType Members
Autodesk.Revit.DB.Electrical Namespace